app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "12233654"], ["created_at", Thu, 01 May 2014 07:06:08 UTC +00:00], ["name", "vijay"], ["title", "any title"], ["updated_at", Thu, 01 May 2014 07:06:08 UTC +00:00]]